{"date_published": "2010-01-18", "author": "aldcroft", "description": "Description: Cross-platform utilities for astronomy with Tk GUI and networkingHomepage URL: http://www.astro.washington.edu/users/rowen/ROPackage/Overview.htmlRO is a package of python utilities with an emphasis on\ncross-platform support (MacOS X, Windows and unix), Astronomy, Tkinter\nGUI extensions and Tkinter-compatible networking. It was developed to\nsupport a telescope user interface (TUI).\n\n\nAddCallback: mixin class for adding callback functionality to any object.\n\t\nAlg: various algorithms\n\t\n\t\n\t\nAstro: Astronomy package, including\nconversion between various coordinate systems and time functions. Note\nthat this library is based Pat Wallace's slalib and as such requires\npayment to for commercial use\nCnvUtil: type conversion utilities\nComm: network communications for Tkinter\napplications. All of these classes use events and callbacks to avoid\nblocking the main event loop.\nDS9: allows one to easily load images into the ds9 image viewer. Images can be loaded from numpy arrays, binary files or fits files. \nConstants:\na few constants for using the RO package\nInputCont: containers for input widgets. Allows easy get and put for a set of input widgets and formatting of complex command strings.\n  \n  \nKeyDispatcher:\nparse input data for keyword/value pairs and set registered\nKeyVariables accordingly. Useful for certain kinds of networked control\napplications. \nKeyVariable: containers for keyword/value data.\nUseful for certain kinds of networked control applications, especially\nin conjunction with KeyDispatcher. \nLangUtil: language utilities. \nMathUtil: simple math functions\nOS: file-related functions\nParseMsg: parse keyword-value data. Intended for use by KeyDispatcher.\n  \n  \nPhysConst: some basic units conversion constants and physical constants, especially those related to Astronomy.\n\t\n\t\nPrefs:\na complete implementation of user-settable preferences (using Tkinter),\nincluding automatic updating of fonts and colors and programmable\nupdating of other attributes.\nprocFiles: easy batch processing of files\nPVT: class for representing position, velocity, time data.\n\t\n\t\nScriptRunner:\nexecute user-written scripts that wait for something to happen without\nhalting the main Tkinter event loop. \nSeqUtil: sequence utilities\nStringUtil: string utilities including conversion of sexagesimal (dd:mm:ss and hh:mm:ss) strings to and from numbers.\n  \n  \nTkUtil: utility functions for working with Tkinter\nWdg:\nextensions of the standard Tkinter widgets and useful additional\nwidgets.", "tags": ["coordinates", "ds9"], "title": "RO"}