{"date_published": "2009-11-17", "author": "tom", "description": "<div class=\"entry\" id=\"blogbody\">\n            Description: AstroAsciiData is a module to handle ASCII tables<br/>Homepage URL: <a href=\"http://www.stecf.org/software/PYTHONtools/astroasciidata/\">http://www.stecf.org/software/PYTHONtools/astroasciidata/</a><br/><br/>AstroAsciiData is a Python module to handle ASCII tables.  Features:<br/><br/>    * Imports all reasonably well-formed Ascii tables<br/>    * Column-first access<br/>    * Easy creation and manipulation of tables, columns, rows and attached comments<br/>    * Retains formatting of data values<br/>    * Support for SExtractor style headers<br/>    * Column sorting<br/>    * Interchangeable comment character, column delimiter and null value<br/>    * Exports data to:<br/>          o Ascii<br/>          o Numpy/Numarray<br/>          o FITS table<br/>          o HTML table format<br/>          o LaTeX table format <br/><br/>The idea to develop this Python module emerged from the fact that ASCII tables continue to be one of the most popular and widely used data exchange formats in astronomy and probably science in general. Moreover the Python language is developing into some kind of standard programming language in astronomy, and being able to handle this major data exchange format in a nice way within it would would be very advantageous.<br/><br/>The development of the AstroAsciiData module is taking place as part of the AstroLib project, an open source effort to develop general astronomical utilities akin to those available in the IDL ASTRON package.<br/><br/>The prime focus of the module is not computational speed, since the ASCII tables used in astronomy are rather small (&lt;10MB) and thus very easy to handle for modern day computers. The main effort was clearly to maximize the convenience for the user to keep the threshold for installing and using the AstroAsciiData module as low as possible.<br/><br/> It is part of the <a href=\"https://trac6.assembla.com/astrolib\" target=\"_blank\" title=\"astrolib library trac\">Astrolib</a> repository.\n        </div>", "tags": ["tables", "astrolib"], "title": "AstroAsciiData"}