{"date_published": "2010-09-23", "author": "virtualastronomer", "description": "<div class=\"entry\" id=\"blogbody\">\n            Description: Astrolib is a software repository for centralizing astronomy community contributed code for Python.<br/>Homepage URL: <a href=\"http://project.orghttps://trac6.assembla.com/astrolib\" target=\"_blank\" title=\"astrolib trac\">https://trac6.assembla.com/astrolib</a><br/><br/>The goal of the AstroLib repository is to become a center of astronomy community contributed code for Python.  From the public announcement of AstroLib as a repository for astronomy python software:  <br/><br/><em>\"If you have written a module  that you believe is useful for others and would like to make it  available, please consider keeping the code in the astrolib repository.<br/><br/>There are some minimal requirements. The software:<br/></em><ul>\n<li><em>must be useful for astronomy (but we don't rule out general purpose tools that aren't available else where (we'll worry about contributing to scipy or other more general purpose sets when the software proves useful in other fields)</em></li>\n<li><em>must have an open source license (preferably BSD, MIT, LGPL, but we</em> can accept GPL)</li>\n<li><em>must be usable from Python</em></li>\n<li><em>may call other languages or even executables that are not part of the repository.</em></li>\n<li><em>may include embedded C, C++, Fortran code called from Python</em>\"</li>\n</ul>\n<br/>There are currently 7 active components:<br/><br/><strong>asciidata</strong>: a Python module to handle (read/modify/write) ASCII tables<br/><br/><strong>asciitable</strong>: an extensible ASCII table reader<br/><br/><strong>pysynphot</strong>: a synthetic photometry software package<br/><br/><strong>coords</strong>: for managing astronomical coordinate systems<br/><br/><strong>tfit</strong>: for photometry of mixed-resolution data sets<br/><br/><strong>pywcs</strong>: a set of routines for handling the FITS World Coordinate System<br/><br/><strong>vo</strong>: library to parse, validate and generate the VO XML Table format<br/><br/><strong></strong>\n</div>", "tags": ["astrolib", "repository"], "title": "AstroLib"}