{"date_published": "2014-01-20", "author": "aldcroft", "description": "One of the big goals of Astropy is to remove the line between developers and users.  We want to empower the astronomy community to be a part of the process.  What does that mean exactly?  It means that if you see something in Astropy that is wrong or missing, you can not only report this (which is a great first step), but you can fix it!  It's like being given the keys to the car since you don't just have to passively wait and hope that someone else makes the fix.  You can just do it, and this is an amazing feeling!So, if you are excited about using Python for astronomy and would like to \njoin the Astropy community and make a contribution, please read on.The Astropy project welcomes contributions at all levels, and here I want to address the \"newbies\" out there.  I use this term in a totally positive way as people who are enthusiastic and interested, but new to the process, whether it be coding in Python or contributing to an open-source project.The first thing to do is to visit the Contribute to Astropy page.  There you will find a nice description of ways to contribute.  This could be as simple as dropping an email, saying for instance that you noticed a mistake in the documentation.  To take it to the next level, you can actually fix the mistake!  If you want to contribute code but don't know what needs to be done, we have you covered.  On the astropy github site, we have identified a list of Easy issues that are specifically set aside as not requiring deep knowledge of astropy.  Some of them might just be a few lines of code or docs, though as you'll learn, developing robust software usually involves writing tests and documentation so it always expands.  This is where you can learn from the Astropy developers how to write better software and improve your coding skills.At this point you'll need to bite the bullet and learn about how to setup and use git / github.  There is no getting around that the first time you see this all it may seem intimidating.  Basically you need to start with the How To: Contribute to Astropy page, relax with a nice big mug of tea, and slowly follow the steps.  Have faith that someday it will all (mostly) make sense.  If you get stuck there is a very friendly community on the astropy-dev mailing list that will help you.  Don't be shy.So with that, hope to see you on github or the mailing lists!", "tags": ["astropy"], "title": "Contributing to Astropy for newbies"}