{"date_published": "2010-12-15", "author": "aldcroft", "description": "<div class=\"entry\" id=\"blogbody\">\n<p>Using Python packages that are not included within the CIAO distribution is straightforward.  The key is that you need to use the CIAO python executable to install those packages into a location where CIAO python will find them.  In general the CIAO python will NOT find packages that are included in your system python installation -- these two are distinct and you must use one or the other.  Fortunately there is a common ground where a user can install packages that can be seen by both the system python and the CIAO python.  This is the $HOME/.local directory tree.  <br/><br/>The following shows step-by-step how to install the necessary packages in order to easily install packages for use within CIAO and Sherpa.  </p><p></p><h4>Get into CIAO environment </h4>First initialize the CIAO environment in the usual way:<br/><p>% source &lt;ciao_root&gt;/bin/ciao.csh  # csh<br/>% . &lt;ciao_root&gt;/bin/ciao.sh  # sh</p><h4>Install the distribute / setuptools module and easy_install</h4>% curl -O http://pypi.python.org/packages/source/d/distribute/distribute-0.6.14.tar.gz<br/>% tar -xzvf distribute-0.6.14.tar.gz<br/>% cd distribute-0.6.14<br/>% python setup.py install --user <p></p><h4>Install external packages from PyPI</h4>Now you are ready to install the external packages you want.  Often these packages are available on PyPI and can be installed with a single command:<br/><br/>% python ~/.local/bin/easy_install --user &lt;python_package&gt;<br/><br/>The --user flag is what instructs easy_install to install the package in your ~/.local area.  As a specific example:<br/><br/>% python ~/.local/bin/easy_install --user asciitable<br/><br/><h4>Install packages from source</h4>If instead you have a source distribution tarball that you downloaded then do the following:<br/><br/>% untar &lt;python_package&gt;.tar.gz<br/>% cd &lt;python_package&gt;<br/>% python setup.py install --user<br/><br/><h4>Install simple module</h4>For simple python modules that are just a single file you only need to copy it to the right location:<br/><br/>% cp simple_module.py ~/.local/lib/python2.6/site-packages/<br/><br/><h4>Remember</h4>Don't forget that whenever you install a new package this way you need to be in the CIAO environment so that you are using the CIAO python to do the installation.\n        </div>", "tags": ["sherpa", "environment"], "title": "External Python packages in CIAO or Sherpa analysis"}