{"date_published": "2009-12-16", "author": "virtualastronomer", "description": "<div class=\"entry\" id=\"blogbody\">\n            Taking your first steps into python can be daunting and there are a bewildering number of tutorials available if you start googling.  Here we try to single out a few of the best that can get you going and show the basic tools that are available for scientific analysis in python.<br/><span style=\"font-weight: bold;\"></span><h4><br/></h4><h4>Python language</h4>One good (though somewhat unorthodox) online introduction to the Python language itself is <a href=\"http://www.diveintopython.net\">Dive Into Python</a>.  This includes some very useful explanation of which Python version is the right one for you depending on platform.  This is especially relevant if you are working on MacOSX.  Just the first three chapters will get you 95% of the way to being able to use python effectively for analysis.<br/><br/>A more traditional and very reasonable introduction is the <a href=\"http://docs.python.org/tutorial/\">python.org tutorial</a>.<br/><h4><br/></h4><h4>Tools overview</h4>For a quick introduction to the basic tools numpy, scipy, and matplotlib that you'll use for analysis see <a href=\"http://www.scipy.org/Getting_Started\">http://www.scipy.org/Getting_Started</a>.<br/><h4><br/></h4><h4>Numerical analysis<br/></h4>The core numerical analysis module for python is numpy and you can get started with <a href=\"http://www.scipy.org/Tentative_NumPy_Tutorial\">http://www.scipy.org/Tentative_NumPy_Tutorial</a>.  The numpy package is at the bottom of almost everything astronomy related in python.<br/><h4><br/></h4><h4>Plotting</h4>There are plenty of 1-d and 2-d plotting packages available within python but the most popular general purpose package is matplotlib.  This package is modeled after Matlab and for basic plots is extremely simple to use.  A nice tutorial showing the basic features is <a href=\"http://matplotlib.sourceforge.net/users/pyplot_tutorial.html\">http://matplotlib.sourceforge.net/users/pyplot_tutorial.html</a>.<br/><br/>For making publication quality 2-d image plots of astronomical images you'll want to check out the <a href=\"http://aplpy.github.com/documentation/quickstart.html\">APLpy quick start guide</a>.<br/><h4><br/></h4><h4>Scientific tools</h4>The scipy module provides the core set of scientific tools and algorithms for analysis.  Included within the reference guide is a good tour of some key functionality including numerical integration, interpolation, signal processing, statistics and image processing.  See <a href=\"http://docs.scipy.org/doc/scipy/reference/\">http://docs.scipy.org/doc/scipy/reference/</a>.<br/><h4><br/></h4><h4>Astronomy data reduction</h4>A tutorial introduction to data analysis and the Python installation is available at the <a href=\"http://python4astronomers.github.com/\">Python for Astronomers</a> site.<br/><br/>A bit more hardcore (and slightly dated) but directed exactly to astronomers is the tutorial on using python for interactive data analysis in astronomy.  The course web page is <a href=\"http://www.scipy.org/wikis/topical_software/Tutorial\">http://www.scipy.org/wikis/topical_software/Tutorial</a>.  For some reason I can never see the actual tutorial in that web page, but the PDF is at <a href=\"http://stsdas.stsci.edu/perry/pydatatut.pdf\">http://stsdas.stsci.edu/perry/pydatatut.pdf</a>.<br/><strong><br/></strong>\n</div>", "tags": ["numpy", "scipy", "matplotlib", "images", "plotting"], "title": "Getting started with python in astronomy"}