{"date_published": "2011-03-16", "author": "phn", "description": "<div class=\"entry\" id=\"blogbody\">\n<strong><h2></h2><h2 style=\"text-align: center;\">Astronomy at PyCon US 2011</h2></strong><p></p><p style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \">The PyCon 2011 Atlanta conference featured several talks on the use of Python in science, engineering, and data analysis. Two of the talks were related to astronomy.</p><p style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \">Maciej Fijalkowski, one of the developer of <a class=\"reference external\" href=\"http://pypy.org/\">PyPy</a>, works at SKA South Africa and he <a class=\"reference external\" href=\"http://pycon.blip.tv/file/4881233/\">talked about</a> how SKA South Africa is using Python for the day to day functioning of the KAT7 array at Karroo. The KAT7 array is a prototype for the MeerKAT array, which in turn is a precursor for the SKA.</p><p style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \">Some of the tasks for which they use Python are:</p><blockquote style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \"><ul class=\"simple\" style=\"margin-bottom: 1em; \"><li>A simulator for the entire telescope system.</li>\n<li>Checking status of telescope instruments.</li>\n<li>Checking weather status.</li>\n<li>Pointing the telescope (from an iPython prompt!).</li>\n<li>Introspect features of an antenna.</li>\n</ul>\n</blockquote><p style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \">According to him the system will scale to 1000s of antennas, which is the aim of SKA. The project has already <a class=\"reference external\" href=\"http://us.pycon.org/2011/schedule/presentations/159/\">released portions of the code base under open source license</a> (links at the bottom of this URL).</p><p style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \"><a class=\"reference external\" href=\"http://pycon.blip.tv/file/4883198/\">Michael Sims from NASA AMES gave a talk</a> on his experience in using Python for designing an automation system for the Mars Exploration Rovers. Among many other roles at NASA, he is a co-investigator on the Mars Exploration Rovers project, and is part of the science team and the operations team for the rovers.</p><p style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \">The system he designed is called AutoPUL: Auto Payload Uplink Lead. This system was designed to generate a set of \"commands\" for the operations of the on-board cameras, deliver these commands to the rovers, create web pages as reports, and for many other operations. AutoPUL, and other automated components, reduced the time needed for generating these commands from 8-12 hours to about 15 minutes.</p><p style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \">Based on his experience in building AutoPUL, he mentions the following as the pros and cons of Python:</p><blockquote style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \"><ul class=\"simple\" style=\"margin-bottom: 1em; \"><li>Maintenance has been mostly trivial, with one exception. Bugs were small in number, approximately 1 per year, and gets fixed in an hour or so.</li>\n<li>Python is good at interacting with the operating system.</li>\n<li>https (urllib2) processing was problematic.</li>\n</ul>\n</blockquote><p style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \">According to him the utility of Python comes from the way it saves programmer's time, the correctness of programs due to the its' simplicity, its' robustness, and facilities for user interactions. He points out that optimization for execution speed is done only when it becomes an issue.</p><p style=\"font-family: 'Times New Roman'; line-height: normal; font-size: medium; \"></p><p>He concludes with the following observations:</p><blockquote>\"Python for me is a tool for creating sculptures of interaction. It is not particularly interesting in and of itself. A sculptor's clay. Overall, I'm amazingly pleased at what I can easily build with Python.\"</blockquote><p>As a bonus, the video shows a great virtual reality simulation, starting at 24:40!</p><p>In addition to the two talks, Miguel de Val-Borro <a class=\"reference external\" href=\"http://mail.scipy.org/pipermail/astropy/2011-March/001170.html\">mentions</a> that he has a poster on Herschel data reduction and visualization using Python tools.</p><p>The full list of talks presented at PyCon 2011 is available at <a class=\"reference external\" href=\"http://us.pycon.org/2011/schedule/\">this url</a>. Videos for the talks are available at the <a class=\"reference external\" href=\"http://pycon.blip.tv/?sort=custom;date=;view=archive;user=pycon;nsfw=dc;s=posts;page=1\">pycon section of blip.tv</a> .</p>\n</div>", "tags": ["pycon 2011"], "title": "Astronomy at PyCon US 2011"}