{"date_published": "2011-03-08", "author": "virtualastronomer", "description": "<div class=\"entry\" id=\"blogbody\">\n<br/>\nThe German Astrophysical Virtual Observatory is creating a Data Center \nHelper Suite of <a href=\"http://vo.ari.uni-heidelberg.de/docs/DaCHS/\" target=\"_blank\">software</a> to provide a \"publishing infrastructure for the\n Virtual Observatory, including a flexible component for ingesting and \nmapping data, integrated metadata handling with a publishing registry, \nand support for many VO protocols and standards\"<br/>\n<br/>The software suite has many audiences, including both the everyday astronomer, the database architect and the software developer.<br/><br/>Their \"<a href=\"http://vo.ari.uni-heidelberg.de/docs/DaCHS/votable.html\" target=\"_blank\">votable</a>\" library is relevant for everyday astronomers using python. This library has the primary task of importing (into python) the XML files used in the virtual observatory to deliver <a href=\"http://en.wikipedia.org/wiki/Structured_data\" target=\"_blank\">structured data</a>.  An <a href=\"http://vo.ari.uni-heidelberg.de/docs/DaCHS/tapquery.html\" target=\"_blank\">extension</a> to this library is a tool to query remote astronomy databases, having the data and metadata returned into your python session.  <br/><br/>There is also a \"<a href=\"http://vo.ari.uni-heidelberg.de/docs/tapsh-manual.html\" target=\"_blank\">shell</a>\" for running these remote table queries with the nice feature that it can connect to other VO software like <a href=\"http://www.star.bris.ac.uk/%7Embt/topcat/\" target=\"_blank\">TOPCAT</a> (using the unpleasant sounding acronym <a href=\"http://www.ivoa.net/Documents/latest/SAMP.html\" target=\"_blank\">SAMP</a>). This <a href=\"http://vo.ari.uni-heidelberg.de/propaganda/tapmovie.avi\" target=\"_blank\">screencast</a> is an excellent quick look into how to use this shell, which also helps you to understand why these tools are being written.  Some additional libraries are available for especially complex issues structured data in astronomy. <br/>\n</div>", "tags": ["vo"], "title": "Querying tables in the virtual observatory"}