{"date_published": "2013-11-26", "author": "aldcroft", "description": "<div class=\"entry\" id=\"blogbody\">\n<p><em>From Erik Tollerud, Thomas Robitaille, and Perry Greenfield on behalf of The Astropy Collaboration:</em></p><p><strong>We are very happy to announce the second major public release (v0.3) of the Astropy package, a core Python package for Astronomy:</strong><br/><br/>   <a href=\"http://www.astropy.org\" target=\"_blank\">http://www.astropy.org</a><br/><br/>Astropy is a community-driven package intended to contain much of the core functionality and common tools needed for performing astronomy and  astrophysics with Python.<br/><br/>New and improved functionality in this release includes:<br/><br/>* A new modeling package which provides a framework for fitting models to data<br/>* Quantity has been re-implemented as a numpy array subclass,<br/>enhancing performance and usability<br/>* Unit conversion and Quantities are better integrated with other<br/>parts of Astropy, simplifying many APIs and user code.<br/>* New Table functionality for joining and aggregating tables<br/>* Support for arrays of celestial coordinates<br/>* A new virtual observatory cone search package<br/>* A dedicated convolution sub-package with many predefined kernels<br/><br/>A full list of improvements, including examples, is provided at:<br/><br/>   <a href=\"http://docs.astropy.org/en/latest/whatsnew/0.3.html\" target=\"_blank\">http://docs.astropy.org/en/latest/whatsnew/0.3.html</a><br/><br/>Instructions for installing Astropy are provided at the <a href=\"http://www.astropy.org\" target=\"_blank\">http://www.astropy.org</a>  website, and extensive documentation can be found at:<br/><br/>   <a href=\"http://docs.astropy.org\" target=\"_blank\">http://docs.astropy.org</a><br/><br/>Please report any issues, or request new features via our GitHub repository:<br/><br/>   <a href=\"https://github.com/astropy/astropy/issues\" target=\"_blank\">https://github.com/astropy/astropy/issues</a><br/><br/>Over 50 developers have contributed code to Astropy so far, and you can find out more about the team behind Astropy here:<br/><br/>   <a href=\"http://www.astropy.org/team.html\" target=\"_blank\">http://www.astropy.org/team.html</a><br/><br/>If you use Astropy directly - or as a dependency to another package - for your work, please remember to include the following acknowledgment at the end of papers:<br/><br/>\"This research made use of Astropy, a community-developed core Python package for Astronomy (Astropy Collaboration, 2013).\"<br/><br/>where “(Astropy Collaboration, 2013)” is the Astropy paper which was published this year:<br/><br/> <a href=\"http://adsabs.harvard.edu/abs/2013A%26A...558A..33A\" target=\"_blank\">http://adsabs.harvard.edu/abs/2013A%26A...558A..33A</a><br/><br/>Please feel free to forward this announcement to anyone you think might be interested in this release.<br/><br/>We hope that you enjoy using Astropy as much as we enjoyed developing it!</p>\n</div>", "tags": ["astrolib", "coordinates", "cosmology", "datetime", "FITS", "IPAC", "photometry", "PyFITS", "statistics", "tables", "vo", "votable", "WCS"], "title": "Astropy 0.3 released"}